; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v3)
             (pred_11 ?v9 ?v7)
             (pred_1 ?v8 ?v7)
             (pred_2 ?v6 ?v8 )
	     (pred_9 ?v8)
             (pred_10 ?v4)
             (pred_8 ?v9)
             (pred_12 ?v7)
             (pred_4 ?v8)
             (pred_3 ?v9)
             (pred_7 ?v8)
             (pred_5 ))



(:action op_1
:parameters (?v1 ?v5 ?v13 ?v10)
:precondition (and (pred_10 ?v1) (pred_10 ?v5) (pred_8 ?v13) (pred_12 ?v10)
          (pred_6 ?v1 ?v5) (pred_11 ?v13 ?v10)
                   (pred_1 ?v5 ?v10) (pred_9 ?v1) 
                   (pred_4 ?v5) (pred_3 ?v13))
:effect (and  (pred_7 ?v5) (not (pred_4 ?v5))))


(:action op_2
:parameters (?v1 ?v2)
:precondition (and (pred_10 ?v1) (pred_10 ?v2)
               (pred_9 ?v1) (pred_6 ?v1 ?v2) (pred_7 ?v2))
:effect (and (pred_9 ?v2) (not (pred_9 ?v1))))

(:action op_4
:parameters (?v1 ?v13)
:precondition (and (pred_10 ?v1) (pred_8 ?v13) 
                  (pred_9 ?v1) (pred_2 ?v13 ?v1) (pred_5 ))
:effect (and (pred_3 ?v13)
   (not (pred_2 ?v13 ?v1)) (not (pred_5 ))))


(:action op_3
:parameters (?v1 ?v12 ?v11)
:precondition (and (pred_10 ?v1) (pred_8 ?v12) (pred_8 ?v11)
                  (pred_9 ?v1) (pred_3 ?v11) (pred_2 ?v12 ?v1))
:effect (and (pred_3 ?v12) (pred_2 ?v11 ?v1)
        (not (pred_3 ?v11)) (not (pred_2 ?v12 ?v1))))

(:action op_5
:parameters (?v1 ?v13)
:precondition (and (pred_10 ?v1) (pred_8 ?v13) 
                  (pred_9 ?v1) (pred_3 ?v13))
:effect (and (pred_5 ) (pred_2 ?v13 ?v1) (not (pred_3 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_16 obj_05 obj_28 obj_17 obj_08 obj_25 obj_32 obj_09 obj_23 obj_04 obj_26 obj_15 obj_30 obj_20 obj_27 obj_19 obj_29 obj_12 obj_03 obj_10 obj_31 obj_13 obj_18 obj_06 obj_22
    obj_21 obj_02 obj_07
    obj_24 obj_11 obj_01 obj_14
    )

    (:init
       (pred_5)

       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_28)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_10 obj_25)
       (pred_10 obj_32)
       (pred_10 obj_09)
       (pred_10 obj_23)
       (pred_10 obj_04)
       (pred_10 obj_26)
       (pred_10 obj_15)
       (pred_10 obj_30)
       (pred_10 obj_20)
       (pred_10 obj_27)
       (pred_10 obj_19)
       (pred_10 obj_29)
       (pred_10 obj_12)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_31)
       (pred_10 obj_13)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_10 obj_22)
       (pred_12 obj_21)
       (pred_12 obj_02)
       (pred_12 obj_07)
       (pred_8 obj_24)
       (pred_8 obj_11)
       (pred_8 obj_01)
       (pred_8 obj_14)

       (pred_6 obj_16 obj_25)
       (pred_6 obj_16 obj_05)
       (pred_6 obj_05 obj_32)
       (pred_6 obj_05 obj_28)
       (pred_6 obj_05 obj_16)
       (pred_6 obj_28 obj_09)
       (pred_6 obj_28 obj_17)
       (pred_6 obj_28 obj_05)
       (pred_6 obj_17 obj_23)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_17 obj_28)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_25 obj_26)
       (pred_6 obj_25 obj_32)
       (pred_6 obj_25 obj_16)
       (pred_6 obj_32 obj_15)
       (pred_6 obj_32 obj_09)
       (pred_6 obj_32 obj_05)
       (pred_6 obj_32 obj_25)
       (pred_6 obj_09 obj_30)
       (pred_6 obj_09 obj_23)
       (pred_6 obj_09 obj_28)
       (pred_6 obj_09 obj_32)
       (pred_6 obj_23 obj_20)
       (pred_6 obj_23 obj_04)
       (pred_6 obj_23 obj_17)
       (pred_6 obj_23 obj_09)
       (pred_6 obj_04 obj_27)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_04 obj_23)
       (pred_6 obj_26 obj_19)
       (pred_6 obj_26 obj_15)
       (pred_6 obj_26 obj_25)
       (pred_6 obj_15 obj_29)
       (pred_6 obj_15 obj_30)
       (pred_6 obj_15 obj_32)
       (pred_6 obj_15 obj_26)
       (pred_6 obj_30 obj_12)
       (pred_6 obj_30 obj_20)
       (pred_6 obj_30 obj_09)
       (pred_6 obj_30 obj_15)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_20 obj_27)
       (pred_6 obj_20 obj_23)
       (pred_6 obj_20 obj_30)
       (pred_6 obj_27 obj_10)
       (pred_6 obj_27 obj_04)
       (pred_6 obj_27 obj_20)
       (pred_6 obj_19 obj_31)
       (pred_6 obj_19 obj_29)
       (pred_6 obj_19 obj_26)
       (pred_6 obj_29 obj_13)
       (pred_6 obj_29 obj_12)
       (pred_6 obj_29 obj_15)
       (pred_6 obj_29 obj_19)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_12 obj_03)
       (pred_6 obj_12 obj_30)
       (pred_6 obj_12 obj_29)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_10 obj_22)
       (pred_6 obj_10 obj_27)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_31 obj_13)
       (pred_6 obj_31 obj_19)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_29)
       (pred_6 obj_13 obj_31)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_06 obj_22)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_22 obj_10)
       (pred_6 obj_22 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_30)
       (pred_4 obj_28)
       (pred_4 obj_25)
       (pred_1  obj_15 obj_21)
       (pred_1  obj_30 obj_02)
       (pred_1  obj_28 obj_07)
       (pred_1  obj_25 obj_07)
       (pred_7 obj_16)
       (pred_7 obj_05)
       (pred_7 obj_17)
       (pred_7 obj_08)
       (pred_7 obj_32)
       (pred_7 obj_09)
       (pred_7 obj_23)
       (pred_7 obj_04)
       (pred_7 obj_26)
       (pred_7 obj_20)
       (pred_7 obj_27)
       (pred_7 obj_19)
       (pred_7 obj_29)
       (pred_7 obj_12)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_31)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_06)
       (pred_7 obj_22)

       (pred_11  obj_24 obj_21)
       (pred_11  obj_11 obj_02)
       (pred_11  obj_01 obj_07)
       (pred_11  obj_14 obj_21)
       (pred_2 obj_24 obj_03)
       (pred_2 obj_11 obj_08)
       (pred_2 obj_01 obj_22)
       (pred_2 obj_14 obj_19)
       (pred_9 obj_03)
    )

    (:goal (and
       (pred_2 obj_24 obj_31)
       (pred_2 obj_11 obj_32)
       (pred_2 obj_01 obj_32)
       (pred_2 obj_14 obj_04)
    ))
(:constraints
  (always (not (pred_9 obj_12)))
)
)

; plan
1. (op_2 obj_03 obj_10)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_10)
   goals met: 0 of 4
2. (op_2 obj_10 obj_22)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_22)
   goals met: 0 of 4
3. (op_4 obj_22 obj_01)
   deleted: (pred_2 obj_01 obj_22) (pred_5)
   added: (pred_3 obj_01)
   goals met: 0 of 4
4. (op_2 obj_22 obj_10)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_10)
   goals met: 0 of 4
5. (op_2 obj_10 obj_27)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_27)
   goals met: 0 of 4
6. (op_2 obj_27 obj_04)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_04)
   goals met: 0 of 4
7. (op_2 obj_04 obj_08)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_08)
   goals met: 0 of 4
8. (op_3 obj_08 obj_11 obj_01)
   deleted: (pred_3 obj_01) (pred_2 obj_11 obj_08)
   added: (pred_3 obj_11) (pred_2 obj_01 obj_08)
   goals met: 0 of 4
9. (op_2 obj_08 obj_04)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_04)
   goals met: 0 of 4
10. (op_5 obj_04 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_5) (pred_2 obj_11 obj_04)
   goals met: 0 of 4
11. (op_2 obj_04 obj_08)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_08)
   goals met: 0 of 4
12. (op_4 obj_08 obj_01)
   deleted: (pred_2 obj_01 obj_08) (pred_5)
   added: (pred_3 obj_01)
   goals met: 0 of 4
13. (op_2 obj_08 obj_04)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_04)
   goals met: 0 of 4
14. (op_2 obj_04 obj_23)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_23)
   goals met: 0 of 4
15. (op_2 obj_23 obj_09)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_09)
   goals met: 0 of 4
16. (op_2 obj_09 obj_32)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_32)
   goals met: 0 of 4
17. (op_1 obj_32 obj_25 obj_01 obj_07)
   deleted: (pred_4 obj_25)
   added: (pred_7 obj_25)
   goals met: 0 of 4
18. (op_5 obj_32 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_5) (pred_2 obj_01 obj_32)
   goals met: 1 of 4
19. (op_2 obj_32 obj_09)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_09)
   goals met: 1 of 4
20. (op_2 obj_09 obj_23)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_23)
   goals met: 1 of 4
21. (op_2 obj_23 obj_20)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_20)
   goals met: 1 of 4
22. (op_2 obj_20 obj_03)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_03)
   goals met: 1 of 4
23. (op_4 obj_03 obj_24)
   deleted: (pred_2 obj_24 obj_03) (pred_5)
   added: (pred_3 obj_24)
   goals met: 1 of 4
24. (op_2 obj_03 obj_20)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_20)
   goals met: 1 of 4
25. (op_2 obj_20 obj_23)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_23)
   goals met: 1 of 4
26. (op_2 obj_23 obj_04)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_04)
   goals met: 1 of 4
27. (op_3 obj_04 obj_11 obj_24)
   deleted: (pred_3 obj_24) (pred_2 obj_11 obj_04)
   added: (pred_3 obj_11) (pred_2 obj_24 obj_04)
   goals met: 1 of 4
28. (op_2 obj_04 obj_23)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_23)
   goals met: 1 of 4
29. (op_2 obj_23 obj_09)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_09)
   goals met: 1 of 4
30. (op_2 obj_09 obj_32)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_32)
   goals met: 1 of 4
31. (op_5 obj_32 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_5) (pred_2 obj_11 obj_32)
   goals met: 2 of 4
32. (op_2 obj_32 obj_09)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_09)
   goals met: 2 of 4
33. (op_2 obj_09 obj_23)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_23)
   goals met: 2 of 4
34. (op_2 obj_23 obj_04)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_04)
   goals met: 2 of 4
35. (op_4 obj_04 obj_24)
   deleted: (pred_2 obj_24 obj_04) (pred_5)
   added: (pred_3 obj_24)
   goals met: 2 of 4
36. (op_2 obj_04 obj_23)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_23)
   goals met: 2 of 4
37. (op_2 obj_23 obj_09)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_09)
   goals met: 2 of 4
38. (op_2 obj_09 obj_32)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_32)
   goals met: 2 of 4
39. (op_2 obj_32 obj_25)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_25)
   goals met: 2 of 4
40. (op_2 obj_25 obj_26)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_26)
   goals met: 2 of 4
41. (op_2 obj_26 obj_19)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_19)
   goals met: 2 of 4
42. (op_2 obj_19 obj_31)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_31)
   goals met: 2 of 4
43. (op_5 obj_31 obj_24)
   deleted: (pred_3 obj_24)
   added: (pred_5) (pred_2 obj_24 obj_31)
   goals met: 3 of 4
44. (op_2 obj_31 obj_19)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_19)
   goals met: 3 of 4
45. (op_4 obj_19 obj_14)
   deleted: (pred_2 obj_14 obj_19) (pred_5)
   added: (pred_3 obj_14)
   goals met: 3 of 4
46. (op_2 obj_19 obj_26)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_26)
   goals met: 3 of 4
47. (op_2 obj_26 obj_25)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_25)
   goals met: 3 of 4
48. (op_2 obj_25 obj_32)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_32)
   goals met: 3 of 4
49. (op_2 obj_32 obj_09)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_09)
   goals met: 3 of 4
50. (op_2 obj_09 obj_23)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_23)
   goals met: 3 of 4
51. (op_2 obj_23 obj_04)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_04)
   goals met: 3 of 4
52. (op_5 obj_04 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_5) (pred_2 obj_14 obj_04)
   goals met: 4 of 4
